Tekla.Structures.Drawing.Automation.AutoDrawingRule
The AutoDrawingRule class contains the definition of a rule for the Tekla Structures AutoDrawing tool.

Tekla.Structures.Drawing.Automation.AutoDrawingRule.Filename
The filename of the AutoDrawing script.

Tekla.Structures.Drawing.Automation.AutoDrawingRule.Source
Gets or sets the source.

Tekla.Structures.Drawing.Automation.AutoDrawingRule.#ctor(System.String)
Creates a new AutoDrawing rule by using an existing rule file.
RuleFromFile: The filename of the rule file.

Tekla.Structures.Drawing.Automation.AutoDrawingRule.CheckSourceExistsInFilename(System.String)
Checks if a source is defined within the filename string.
filename:
The filename.
Returns:
The filename without the source key and value.